swimmerCFDcode-in progress/ForceVsDensity/OpenFoamFiles/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\\    /   O peration     | Website:  https://openfoam.org
\\  /    A nd           | Version:  9
\\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
format      ascii;
class       dictionary;
location    "constant";
object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver    solidBody;

cellZone        innerCylinder;

solidBodyMotionFunction  rotatingMotion;

origin      (0 0 0);
axis        (0 1 0);
omega 125.66370614359172;

// ************************************************************************* //
